Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
#define ENET_QOS_MAC_HW_FEAT_TXQCNT_MASK         (0x3C0U)
#define ENET_QOS_MAC_HW_FEAT_TXQCNT_SHIFT        (6U)
/*! TXQCNT - Number of MTL Transmit Queues This field indicates the number of MTL Transmit queues:
 *  0b0000..1 MTL Tx Queue
 *  0b0001..2 MTL Tx Queues
 *  0b0010..3 MTL Tx Queues
 *  0b0011..4 MTL Tx Queues
 *  0b0100..5 MTL Tx Queues
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_TXQCNT(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TXQCNT_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TXQCNT_MASK)

#define ENET_QOS_MAC_HW_FEAT_MGKSEL_MASK         (0x80U)
#define ENET_QOS_MAC_HW_FEAT_MGKSEL_SHIFT        (7U)
/*! MGKSEL - PMT Magic Packet Enable This bit is set to 1 when the Enable Magic Packet Detection option is selected
 *  0b0..PMT Magic Packet Enable option is not selected
 *  0b1..PMT Magic Packet Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_MGKSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_MGKSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_MGKSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_MMCSEL_MASK         (0x100U)
#define ENET_QOS_MAC_HW_FEAT_MMCSEL_SHIFT        (8U)
/*! MMCSEL - RMON Module Enable This bit is set to 1 when the Enable MAC Management Counters (MMC) option is selected
 *  0b0..RMON Module Enable option is not selected
 *  0b1..RMON Module Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_MMCSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_MMCSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_MMCSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_ARPOFFSEL_MASK      (0x200U)
#define ENET_QOS_MAC_HW_FEAT_ARPOFFSEL_SHIFT     (9U)
/*! ARPOFFSEL - ARP Offload Enabled This bit is set to 1 when the Enable IPv4 ARP Offload option is selected
 *  0b0..ARP Offload Enable option is not selected
 *  0b1..ARP Offload Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_ARPOFFSEL(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ARPOFFSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ARPOFFSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_PDUPSEL_MASK        (0x200U)
#define ENET_QOS_MAC_HW_FEAT_PDUPSEL_SHIFT       (9U)
/*! PDUPSEL - Broadcast/Multicast Packet Duplication This bit is set to 1 when the
 *    Broadcast/Multicast Packet Duplication feature is selected.
 *  0b0..Broadcast/Multicast Packet Duplication feature is not selected
 *  0b1..Broadcast/Multicast Packet Duplication feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_PDUPSEL(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_PDUPSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_PDUPSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_FRPSEL_MASK         (0x400U)
#define ENET_QOS_MAC_HW_FEAT_FRPSEL_SHIFT        (10U)
/*! FRPSEL - Flexible Receive Parser Selected This bit is set to 1 when the Enable Flexible
 *    Programmable Receive Parser option is selected.
 *  0b0..Flexible Receive Parser feature is not selected
 *  0b1..Flexible Receive Parser feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_FRPSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_FRPSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_FRPSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_FRPBS_MASK          (0x1800U)
#define ENET_QOS_MAC_HW_FEAT_FRPBS_SHIFT         (11U)
/*! FRPBS - Flexible Receive Parser Buffer size This field indicates the supported Max Number of
 *    bytes of the packet data to be Parsed by Flexible Receive Parser.
 *  0b00..64 Bytes
 *  0b01..128 Bytes
 *  0b10..256 Bytes
 *  0b11..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_FRPBS(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_FRPBS_SHIFT)) & ENET_QOS_MAC_HW_FEAT_FRPBS_MASK)

#define ENET_QOS_MAC_HW_FEAT_OSTEN_MASK          (0x800U)
#define ENET_QOS_MAC_HW_FEAT_OSTEN_SHIFT         (11U)
/*! OSTEN - One-Step Timestamping Enable This bit is set to 1 when the Enable One-Step Timestamp Feature is selected.
 *  0b0..One-Step Timestamping feature is not selected
 *  0b1..One-Step Timestamping feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_OSTEN(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_OSTEN_SHIFT)) & ENET_QOS_MAC_HW_FEAT_OSTEN_MASK)

#define ENET_QOS_MAC_HW_FEAT_PTOEN_MASK          (0x1000U)
#define ENET_QOS_MAC_HW_FEAT_PTOEN_SHIFT         (12U)
/*! PTOEN - PTP Offload Enable This bit is set to 1 when the Enable PTP Timestamp Offload Feature is selected.
 *  0b0..PTP Offload feature is not selected
 *  0b1..PTP Offload feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_PTOEN(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_PTOEN_SHIFT)) & ENET_QOS_MAC_HW_FEAT_PTOEN_MASK)

#define ENET_QOS_MAC_HW_FEAT_RXCHCNT_MASK        (0xF000U)
#define ENET_QOS_MAC_HW_FEAT_RXCHCNT_SHIFT       (12U)
/*! RXCHCNT - Number of DMA Receive Channels This field indicates the number of DMA Receive channels:
 *  0b0000..1 MTL Rx Channel
 *  0b0001..2 MTL Rx Channels
 *  0b0010..3 MTL Rx Channels
 *  0b0011..4 MTL Rx Channels
 *  0b0100..5 MTL Rx Channels
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_RXCHCNT(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_RXCHCNT_SHIFT)) & ENET_QOS_MAC_HW_FEAT_RXCHCNT_MASK)

#define ENET_QOS_MAC_HW_FEAT_TSSEL_MASK          (0x1000U)
#define ENET_QOS_MAC_HW_FEAT_TSSEL_SHIFT         (12U)
/*! TSSEL - IEEE 1588-2008 Timestamp Enabled This bit is set to 1 when the Enable IEEE 1588 Timestamp Support option is selected
 *  0b0..IEEE 1588-2008 Timestamp Enable option is not selected
 *  0b1..IEEE 1588-2008 Timestamp Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_TSSEL(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TSSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TSSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_ADVTHWORD_MASK      (0x2000U)
#define ENET_QOS_MAC_HW_FEAT_ADVTHWORD_SHIFT     (13U)
/*! ADVTHWORD - IEEE 1588 High Word Register Enable This bit is set to 1 when the Add IEEE 1588 Higher Word Register option is selected
 *  0b0..IEEE 1588 High Word Register option is not selected
 *  0b1..IEEE 1588 High Word Register option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_ADVTHWORD(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ADVTHWORD_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ADVTHWORD_MASK)

#define ENET_QOS_MAC_HW_FEAT_EEESEL_MASK         (0x2000U)
#define ENET_QOS_MAC_HW_FEAT_EEESEL_SHIFT        (13U)
/*! EEESEL - Energy Efficient Ethernet Enabled This bit is set to 1 when the Enable Energy Efficient
 *    Ethernet (EEE) option is selected
 *  0b0..Energy Efficient Ethernet Enable option is not selected
 *  0b1..Energy Efficient Ethernet Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_EEESEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_EEESEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_EEESEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_FRPES_MASK          (0x6000U)
#define ENET_QOS_MAC_HW_FEAT_FRPES_SHIFT         (13U)
/*! FRPES - Flexible Receive Parser Table Entries size This field indicates the Max Number of Parser
 *    Entries supported by Flexible Receive Parser.
 *  0b00..64 Entries
 *  0b01..128 Entries
 *  0b10..256 Entries
 *  0b11..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_FRPES(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_FRPES_SHIFT)) & ENET_QOS_MAC_HW_FEAT_FRPES_MASK)

