Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
#define ENET_QOS_MAC_HW_FEAT_MACADR32SEL_MASK    (0x800000U)
#define ENET_QOS_MAC_HW_FEAT_MACADR32SEL_SHIFT   (23U)
/*! MACADR32SEL - MAC Addresses 32-63 Selected This bit is set to 1 when the Enable Additional 32
 *    MAC Address Registers (32-63) option is selected
 *  0b0..MAC Addresses 32-63 Select option is not selected
 *  0b1..MAC Addresses 32-63 Select option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_MACADR32SEL(x)      (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_MACADR32SEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_MACADR32SEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_POUOST_MASK         (0x800000U)
#define ENET_QOS_MAC_HW_FEAT_POUOST_SHIFT        (23U)
/*! POUOST - One Step for PTP over UDP/IP Feature Enable This bit is set to 1 when the Enable One
 *    step timestamp for PTP over UDP/IP feature is selected.
 *  0b0..One Step for PTP over UDP/IP Feature is not selected
 *  0b1..One Step for PTP over UDP/IP Feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_POUOST(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_POUOST_SHIFT)) & ENET_QOS_MAC_HW_FEAT_POUOST_MASK)

#define ENET_QOS_MAC_HW_FEAT_HASHTBLSZ_MASK      (0x3000000U)
#define ENET_QOS_MAC_HW_FEAT_HASHTBLSZ_SHIFT     (24U)
/*! HASHTBLSZ - Hash Table Size This field indicates the size of the hash table:
 *  0b00..No hash table
 *  0b01..64
 *  0b10..128
 *  0b11..256
 */
#define ENET_QOS_MAC_HW_FEAT_HASHTBLSZ(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_HASHTBLSZ_SHIFT)) & ENET_QOS_MAC_HW_FEAT_HASHTBLSZ_MASK)

#define ENET_QOS_MAC_HW_FEAT_MACADR64SEL_MASK    (0x1000000U)
#define ENET_QOS_MAC_HW_FEAT_MACADR64SEL_SHIFT   (24U)
/*! MACADR64SEL - MAC Addresses 64-127 Selected This bit is set to 1 when the Enable Additional 64
 *    MAC Address Registers (64-127) option is selected
 *  0b0..MAC Addresses 64-127 Select option is not selected
 *  0b1..MAC Addresses 64-127 Select option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_MACADR64SEL(x)      (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_MACADR64SEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_MACADR64SEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_PPSOUTNUM_MASK      (0x7000000U)
#define ENET_QOS_MAC_HW_FEAT_PPSOUTNUM_SHIFT     (24U)
/*! PPSOUTNUM - Number of PPS Outputs This field indicates the number of PPS outputs:
 *  0b000..No PPS output
 *  0b001..1 PPS output
 *  0b010..2 PPS output
 *  0b011..3 PPS output
 *  0b100..4 PPS output
 *  0b101..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_PPSOUTNUM(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_PPSOUTNUM_SHIFT)) & ENET_QOS_MAC_HW_FEAT_PPSOUTNUM_MASK)

#define ENET_QOS_MAC_HW_FEAT_TSSTSSEL_MASK       (0x6000000U)
#define ENET_QOS_MAC_HW_FEAT_TSSTSSEL_SHIFT      (25U)
/*! TSSTSSEL - Timestamp System Time Source This bit indicates the source of the Timestamp system
 *    time: This bit is set to 1 when the Enable IEEE 1588 Timestamp Support option is selected
 *  0b00..Reserved
 *  0b01..Internal
 *  0b10..External
 *  0b11..Both
 */
#define ENET_QOS_MAC_HW_FEAT_TSSTSSEL(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TSSTSSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TSSTSSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_FPESEL_MASK         (0x4000000U)
#define ENET_QOS_MAC_HW_FEAT_FPESEL_SHIFT        (26U)
/*! FPESEL - Frame Preemption Enable This bit is set to 1 when the Enable Frame preemption feature is selected.
 *  0b0..Frame Preemption Enable feature is not selected
 *  0b1..Frame Preemption Enable feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_FPESEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_FPESEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_FPESEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_L3L4FNUM_MASK       (0x78000000U)
#define ENET_QOS_MAC_HW_FEAT_L3L4FNUM_SHIFT      (27U)
/*! L3L4FNUM - Total number of L3 or L4 Filters This field indicates the total number of L3 or L4 filters:
 *  0b0000..No L3 or L4 Filter
 *  0b0001..1 L3 or L4 Filter
 *  0b0010..2 L3 or L4 Filters
 *  0b0011..3 L3 or L4 Filters
 *  0b0100..4 L3 or L4 Filters
 *  0b0101..5 L3 or L4 Filters
 *  0b0110..6 L3 or L4 Filters
 *  0b0111..7 L3 or L4 Filters
 *  0b1000..8 L3 or L4 Filters
 */
#define ENET_QOS_MAC_HW_FEAT_L3L4FNUM(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_L3L4FNUM_SHIFT)) & ENET_QOS_MAC_HW_FEAT_L3L4FNUM_MASK)

#define ENET_QOS_MAC_HW_FEAT_SAVLANINS_MASK      (0x8000000U)
#define ENET_QOS_MAC_HW_FEAT_SAVLANINS_SHIFT     (27U)
/*! SAVLANINS - Source Address or VLAN Insertion Enable This bit is set to 1 when the Enable SA and
 *    VLAN Insertion on Tx option is selected
 *  0b0..Source Address or VLAN Insertion Enable option is not selected
 *  0b1..Source Address or VLAN Insertion Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_SAVLANINS(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_SAVLANINS_SHIFT)) & ENET_QOS_MAC_HW_FEAT_SAVLANINS_MASK)

#define ENET_QOS_MAC_HW_FEAT_TBSSEL_MASK         (0x8000000U)
#define ENET_QOS_MAC_HW_FEAT_TBSSEL_SHIFT        (27U)
/*! TBSSEL - Time Based Scheduling Enable This bit is set to 1 when the Time Based Scheduling feature is selected.
 *  0b0..Time Based Scheduling Enable feature is not selected
 *  0b1..Time Based Scheduling Enable feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_TBSSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TBSSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TBSSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_ACTPHYSEL_MASK      (0x70000000U)
#define ENET_QOS_MAC_HW_FEAT_ACTPHYSEL_SHIFT     (28U)
/*! ACTPHYSEL - Active PHY Selected When you have multiple PHY interfaces in your configuration,
 *    this field indicates the sampled value of phy_intf_sel_i during reset de-assertion.
 *  0b000..GMII or MII
 *  0b001..RGMII
 *  0b010..SGMII
 *  0b011..TBI
 *  0b100..RMII
 *  0b101..RTBI
 *  0b110..SMII
 *  0b111..RevMII
 */
#define ENET_QOS_MAC_HW_FEAT_ACTPHYSEL(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ACTPHYSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ACTPHYSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_ASP_MASK            (0x30000000U)
#define ENET_QOS_MAC_HW_FEAT_ASP_SHIFT           (28U)
/*! ASP - Automotive Safety Package Following are the encoding for the different Safety features
 *  0b00..No Safety features selected
 *  0b01..Only "ECC protection for external memory" feature is selected
 *  0b10..All the Automotive Safety features are selected without the "Parity Port Enable for external interface" feature
 *  0b11..All the Automotive Safety features are selected with the "Parity Port Enable for external interface" feature
 */
#define ENET_QOS_MAC_HW_FEAT_ASP(x)              (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_ASP_SHIFT)) & ENET_QOS_MAC_HW_FEAT_ASP_MASK)

#define ENET_QOS_MAC_HW_FEAT_AUXSNAPNUM_MASK     (0x70000000U)
#define ENET_QOS_MAC_HW_FEAT_AUXSNAPNUM_SHIFT    (28U)
/*! AUXSNAPNUM - Number of Auxiliary Snapshot Inputs This field indicates the number of auxiliary snapshot inputs:
 *  0b000..No auxiliary input
 *  0b001..1 auxiliary input
 *  0b010..2 auxiliary input
 *  0b011..3 auxiliary input
 *  0b100..4 auxiliary input
 *  0b101..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_AUXSNAPNUM(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_AUXSNAPNUM_SHIFT)) & ENET_QOS_MAC_HW_FEAT_AUXSNAPNUM_MASK)
/*! @} */

/*! @name MAC_MDIO_ADDRESS - MDIO Address */
/*! @{ */

#define ENET_QOS_MAC_MDIO_ADDRESS_GB_MASK        (0x1U)
#define ENET_QOS_MAC_MDIO_ADDRESS_GB_SHIFT       (0U)
/*! GB - GMII Busy The application sets this bit to instruct the SMA to initiate a Read or Write access to the MDIO slave.
 *  0b0..GMII Busy is disabled
 *  0b1..GMII Busy is enabled
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_GB(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_GB_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_GB_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_C45E_MASK      (0x2U)
#define ENET_QOS_MAC_MDIO_ADDRESS_C45E_SHIFT     (1U)
/*! C45E - Clause 45 PHY Enable When this bit is set, Clause 45 capable PHY is connected to MDIO.
 *  0b0..Clause 45 PHY is disabled
 *  0b1..Clause 45 PHY is enabled
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_C45E(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_C45E_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_C45E_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_GOC_0_MASK     (0x4U)
#define ENET_QOS_MAC_MDIO_ADDRESS_GOC_0_SHIFT    (2U)
/*! GOC_0 - GMII Operation Command 0 This is the lower bit of the operation command to the PHY or RevMII.
 *  0b0..GMII Operation Command 0 is disabled
 *  0b1..GMII Operation Command 0 is enabled
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_GOC_0(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_GOC_0_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_GOC_0_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_GOC_1_MASK     (0x8U)
#define ENET_QOS_MAC_MDIO_ADDRESS_GOC_1_SHIFT    (3U)
/*! GOC_1 - GMII Operation Command 1 This bit is higher bit of the operation command to the PHY or
 *    RevMII, GOC_1 and GOC_O is encoded as follows: - 00: Reserved - 01: Write - 10: Post Read
 *    Increment Address for Clause 45 PHY - 11: Read When Clause 22 PHY or RevMII is enabled, only Write
 *    and Read commands are valid.
 *  0b0..GMII Operation Command 1 is disabled
 *  0b1..GMII Operation Command 1 is enabled
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_GOC_1(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_GOC_1_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_GOC_1_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_SKAP_MASK      (0x10U)
#define ENET_QOS_MAC_MDIO_ADDRESS_SKAP_SHIFT     (4U)
/*! SKAP - Skip Address Packet When this bit is set, the SMA does not send the address packets
 *    before read, write, or post-read increment address packets.
 *  0b0..Skip Address Packet is disabled
 *  0b1..Skip Address Packet is enabled
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_SKAP(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_SKAP_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_SKAP_MASK)

