Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
#define ENET_QOS_MAC_MDIO_ADDRESS_CR_MASK        (0xF00U)
#define ENET_QOS_MAC_MDIO_ADDRESS_CR_SHIFT       (8U)
/*! CR - CSR Clock Range The CSR Clock Range selection determines the frequency of the MDC clock
 *    according to the CSR clock frequency used in your design: - 0000: CSR clock = 60-100 MHz; MDC
 *    clock = CSR clock/42 - 0001: CSR clock = 100-150 MHz; MDC clock = CSR clock/62 - 0010: CSR clock
 *    = 20-35 MHz; MDC clock = CSR clock/16 - 0011: CSR clock = 35-60 MHz; MDC clock = CSR clock/26
 *    - 0100: CSR clock = 150-250 MHz; MDC clock = CSR clock/102 - 0101: CSR clock = 250-300 MHz;
 *    MDC clock = CSR clock/124 - 0110: CSR clock = 300-500 MHz; MDC clock = CSR clock/204 - 0111: CSR
 *    clock = 500-800 MHz; MDC clock = CSR clock/324 The suggested range of CSR clock frequency
 *    applicable for each value (when Bit 11 = 0) ensures that the MDC clock is approximately between 1.
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_CR(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_CR_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_CR_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_NTC_MASK       (0x7000U)
#define ENET_QOS_MAC_MDIO_ADDRESS_NTC_SHIFT      (12U)
/*! NTC - Number of Trailing Clocks This field controls the number of trailing clock cycles
 *    generated on gmii_mdc_o (MDC) after the end of transmission of MDIO frame.
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_NTC(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_NTC_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_NTC_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_RDA_MASK       (0x1F0000U)
#define ENET_QOS_MAC_MDIO_ADDRESS_RDA_SHIFT      (16U)
/*! RDA - Register/Device Address These bits select the PHY register in selected Clause 22 PHY device. */
#define ENET_QOS_MAC_MDIO_ADDRESS_RDA(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_RDA_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_RDA_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_PA_MASK        (0x3E00000U)
#define ENET_QOS_MAC_MDIO_ADDRESS_PA_SHIFT       (21U)
/*! PA - Physical Layer Address This field indicates which Clause 22 PHY devices (out of 32 devices) the MAC is accessing. */
#define ENET_QOS_MAC_MDIO_ADDRESS_PA(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_PA_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_PA_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_BTB_MASK       (0x4000000U)
#define ENET_QOS_MAC_MDIO_ADDRESS_BTB_SHIFT      (26U)
/*! BTB - Back to Back transactions When this bit is set and the NTC has value greater than 0, then
 *    the MAC informs the completion of a read or write command at the end of frame transfer (before
 *    the trailing clocks are transmitted).
 *  0b0..Back to Back transactions disabled
 *  0b1..Back to Back transactions enabled
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_BTB(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_BTB_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_BTB_MASK)

#define ENET_QOS_MAC_MDIO_ADDRESS_PSE_MASK       (0x8000000U)
#define ENET_QOS_MAC_MDIO_ADDRESS_PSE_SHIFT      (27U)
/*! PSE - Preamble Suppression Enable When this bit is set, the SMA suppresses the 32-bit preamble
 *    and transmits MDIO frames with only 1 preamble bit.
 *  0b0..Preamble Suppression disabled
 *  0b1..Preamble Suppression enabled
 */
#define ENET_QOS_MAC_MDIO_ADDRESS_PSE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_ADDRESS_PSE_SHIFT)) & ENET_QOS_MAC_MDIO_ADDRESS_PSE_MASK)
/*! @} */

/*! @name MAC_MDIO_DATA - MAC MDIO Data */
/*! @{ */

#define ENET_QOS_MAC_MDIO_DATA_GD_MASK           (0xFFFFU)
#define ENET_QOS_MAC_MDIO_DATA_GD_SHIFT          (0U)
/*! GD - GMII Data This field contains the 16-bit data value read from the PHY or RevMII after a
 *    Management Read operation or the 16-bit data value to be written to the PHY or RevMII before a
 *    Management Write operation.
 */
#define ENET_QOS_MAC_MDIO_DATA_GD(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_DATA_GD_SHIFT)) & ENET_QOS_MAC_MDIO_DATA_GD_MASK)

#define ENET_QOS_MAC_MDIO_DATA_RA_MASK           (0xFFFF0000U)
#define ENET_QOS_MAC_MDIO_DATA_RA_SHIFT          (16U)
/*! RA - Register Address This field is valid only when C45E is set. */
#define ENET_QOS_MAC_MDIO_DATA_RA(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MDIO_DATA_RA_SHIFT)) & ENET_QOS_MAC_MDIO_DATA_RA_MASK)
/*! @} */

/*! @name MAC_CSR_SW_CTRL - CSR Software Control */
/*! @{ */

#define ENET_QOS_MAC_CSR_SW_CTRL_RCWE_MASK       (0x1U)
#define ENET_QOS_MAC_CSR_SW_CTRL_RCWE_SHIFT      (0U)
/*! RCWE - Register Clear on Write 1 Enable When this bit is set, the access mode of some register
 *    fields changes to Clear on Write 1, the application needs to set that respective bit to 1 to
 *    clear it.
 *  0b0..Register Clear on Write 1 is disabled
 *  0b1..Register Clear on Write 1 is enabled
 */
#define ENET_QOS_MAC_CSR_SW_CTRL_RCWE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CSR_SW_CTRL_RCWE_SHIFT)) & ENET_QOS_MAC_CSR_SW_CTRL_RCWE_MASK)
/*! @} */

/*! @name MAC_FPE_CTRL_STS - Frame Preemption Control */
/*! @{ */

#define ENET_QOS_MAC_FPE_CTRL_STS_EFPE_MASK      (0x1U)
#define ENET_QOS_MAC_FPE_CTRL_STS_EFPE_SHIFT     (0U)
/*! EFPE - Enable Tx Frame Preemption When set Frame Preemption Tx functionality is enabled.
 *  0b0..Tx Frame Preemption is disabled
 *  0b1..Tx Frame Preemption is enabled
 */
#define ENET_QOS_MAC_FPE_CTRL_STS_EFPE(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_EFPE_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_EFPE_MASK)

#define ENET_QOS_MAC_FPE_CTRL_STS_SVER_MASK      (0x2U)
#define ENET_QOS_MAC_FPE_CTRL_STS_SVER_SHIFT     (1U)
/*! SVER - Send Verify mPacket When set indicates hardware to send a verify mPacket.
 *  0b0..Send Verify mPacket is disabled
 *  0b1..Send Verify mPacket is enabled
 */
#define ENET_QOS_MAC_FPE_CTRL_STS_SVER(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_SVER_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_SVER_MASK)

#define ENET_QOS_MAC_FPE_CTRL_STS_SRSP_MASK      (0x4U)
#define ENET_QOS_MAC_FPE_CTRL_STS_SRSP_SHIFT     (2U)
/*! SRSP - Send Respond mPacket When set indicates hardware to send a Respond mPacket.
 *  0b0..Send Respond mPacket is disabled
 *  0b1..Send Respond mPacket is enabled
 */
#define ENET_QOS_MAC_FPE_CTRL_STS_SRSP(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_SRSP_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_SRSP_MASK)

#define ENET_QOS_MAC_FPE_CTRL_STS_S1_SET_0_MASK  (0x8U)
#define ENET_QOS_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT (3U)
/*! S1_SET_0 - Reserved, Must be set to "0". */
#define ENET_QOS_MAC_FPE_CTRL_STS_S1_SET_0(x)    (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_S1_SET_0_MASK)

#define ENET_QOS_MAC_FPE_CTRL_STS_RVER_MASK      (0x10000U)
#define ENET_QOS_MAC_FPE_CTRL_STS_RVER_SHIFT     (16U)
/*! RVER - Received Verify Frame Set when a Verify mPacket is received.
 *  0b0..Not received Verify Frame
 *  0b1..Received Verify Frame
 */
#define ENET_QOS_MAC_FPE_CTRL_STS_RVER(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_RVER_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_RVER_MASK)

#define ENET_QOS_MAC_FPE_CTRL_STS_RRSP_MASK      (0x20000U)
#define ENET_QOS_MAC_FPE_CTRL_STS_RRSP_SHIFT     (17U)
/*! RRSP - Received Respond Frame Set when a Respond mPacket is received.
 *  0b0..Not received Respond Frame
 *  0b1..Received Respond Frame
 */
#define ENET_QOS_MAC_FPE_CTRL_STS_RRSP(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_RRSP_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_RRSP_MASK)

#define ENET_QOS_MAC_FPE_CTRL_STS_TVER_MASK      (0x40000U)
#define ENET_QOS_MAC_FPE_CTRL_STS_TVER_SHIFT     (18U)
/*! TVER - Transmitted Verify Frame Set when a Verify mPacket is transmitted (triggered by setting SVER field).
 *  0b0..Not transmitted Verify Frame
 *  0b1..transmitted Verify Frame
 */
#define ENET_QOS_MAC_FPE_CTRL_STS_TVER(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_TVER_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_TVER_MASK)

#define ENET_QOS_MAC_FPE_CTRL_STS_TRSP_MASK      (0x80000U)
#define ENET_QOS_MAC_FPE_CTRL_STS_TRSP_SHIFT     (19U)
/*! TRSP - Transmitted Respond Frame Set when a Respond mPacket is transmitted (triggered by setting SRSP field).
 *  0b0..Not transmitted Respond Frame
 *  0b1..transmitted Respond Frame
 */
#define ENET_QOS_MAC_FPE_CTRL_STS_TRSP(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_FPE_CTRL_STS_TRSP_SHIFT)) & ENET_QOS_MAC_FPE_CTRL_STS_TRSP_MASK)
/*! @} */

