Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
/*! @name MAC_PRESN_TIME_NS - 32-bit Binary Rollover Equivalent Time */
/*! @{ */

#define ENET_QOS_MAC_PRESN_TIME_NS_MPTN_MASK     (0xFFFFFFFFU)
#define ENET_QOS_MAC_PRESN_TIME_NS_MPTN_SHIFT    (0U)
/*! MPTN - MAC 1722 Presentation Time in ns These bits indicate the value of the 32-bit binary
 *    rollover equivalent time of the PTP System Time in ns
 */
#define ENET_QOS_MAC_PRESN_TIME_NS_MPTN(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PRESN_TIME_NS_MPTN_SHIFT)) & ENET_QOS_MAC_PRESN_TIME_NS_MPTN_MASK)
/*! @} */

/*! @name MAC_PRESN_TIME_UPDT - MAC 1722 Presentation Time */
/*! @{ */

#define ENET_QOS_MAC_PRESN_TIME_UPDT_MPTU_MASK   (0xFFFFFFFFU)
#define ENET_QOS_MAC_PRESN_TIME_UPDT_MPTU_SHIFT  (0U)
/*! MPTU - MAC 1722 Presentation Time Update This field holds the init value or the update value for the presentation time. */
#define ENET_QOS_MAC_PRESN_TIME_UPDT_MPTU(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_PRESN_TIME_UPDT_MPTU_SHIFT)) & ENET_QOS_MAC_PRESN_TIME_UPDT_MPTU_MASK)
/*! @} */

/*! @name HIGH - MAC Address0 High..MAC Address63 High */
/*! @{ */

#define ENET_QOS_HIGH_ADDRHI_MASK                (0xFFFFU)
#define ENET_QOS_HIGH_ADDRHI_SHIFT               (0U)
/*! ADDRHI - MAC ADDRESS12 [47:32] This field contains the upper 16 bits[47:32] of the thirteenth 6-byte MAC address. */
#define ENET_QOS_HIGH_ADDRHI(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_QOS_HIGH_ADDRHI_SHIFT)) & ENET_QOS_HIGH_ADDRHI_MASK)

#define ENET_QOS_HIGH_DCS_MASK                   (0x1F0000U)  /* Merged from fields with different position or width, of widths (3, 5), largest definition used */
#define ENET_QOS_HIGH_DCS_SHIFT                  (16U)
/*! DCS - DMA Channel Select If the PDC bit of MAC_EXT_CONFIGURATION register is not set: This field
 *    contains the binary representation of the DMA Channel number to which an Rx packet whose DA
 *    matches the MAC Address(#i) content is routed.
 */
#define ENET_QOS_HIGH_DCS(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_HIGH_DCS_SHIFT)) & ENET_QOS_HIGH_DCS_MASK)  /* Merged from fields with different position or width, of widths (3, 5), largest definition used */

#define ENET_QOS_HIGH_MBC_MASK                   (0x3F000000U)
#define ENET_QOS_HIGH_MBC_SHIFT                  (24U)
/*! MBC - Mask Byte Control These bits are mask control bits for comparing each of the MAC Address bytes. */
#define ENET_QOS_HIGH_MBC(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_HIGH_MBC_SHIFT)) & ENET_QOS_HIGH_MBC_MASK)

#define ENET_QOS_HIGH_SA_MASK                    (0x40000000U)
#define ENET_QOS_HIGH_SA_SHIFT                   (30U)
/*! SA - Source Address When this bit is set, the MAC ADDRESS31[47:0] is used to compare with the SA
 *    fields of the received packet.
 *  0b0..Compare with Destination Address
 *  0b1..Compare with Source Address
 */
#define ENET_QOS_HIGH_SA(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_QOS_HIGH_SA_SHIFT)) & ENET_QOS_HIGH_SA_MASK)

#define ENET_QOS_HIGH_AE_MASK                    (0x80000000U)
#define ENET_QOS_HIGH_AE_SHIFT                   (31U)
/*! AE - Address Enable When this bit is set, the address filter module uses the thirteenth MAC address for perfect filtering.
 *  0b0..INVALID : This bit must be always set to 1
 *  0b1..This bit is always set to 1
 */
#define ENET_QOS_HIGH_AE(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_QOS_HIGH_AE_SHIFT)) & ENET_QOS_HIGH_AE_MASK)
/*! @} */

/* The count of ENET_QOS_HIGH */
#define ENET_QOS_HIGH_COUNT                      (64U)

/*! @name LOW - MAC Address0 Low..MAC Address63 Low */
/*! @{ */

#define ENET_QOS_LOW_ADDRLO_MASK                 (0xFFFFFFFFU)
#define ENET_QOS_LOW_ADDRLO_SHIFT                (0U)
/*! ADDRLO - MAC ADDRESS12 [31:0] This field contains the lower 32 bits of thirteenth 6-byte MAC address. */
#define ENET_QOS_LOW_ADDRLO(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_QOS_LOW_ADDRLO_SHIFT)) & ENET_QOS_LOW_ADDRLO_MASK)
/*! @} */

/* The count of ENET_QOS_LOW */
#define ENET_QOS_LOW_COUNT                       (64U)

/*! @name MAC_MMC_CONTROL - MMC Control */
/*! @{ */

#define ENET_QOS_MAC_MMC_CONTROL_CNTRST_MASK     (0x1U)
#define ENET_QOS_MAC_MMC_CONTROL_CNTRST_SHIFT    (0U)
/*! CNTRST - Counters Reset When this bit is set, all counters are reset.
 *  0b0..Counters are not reset
 *  0b1..All counters are reset
 */
#define ENET_QOS_MAC_MMC_CONTROL_CNTRST(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MMC_CONTROL_CNTRST_SHIFT)) & ENET_QOS_MAC_MMC_CONTROL_CNTRST_MASK)

#define ENET_QOS_MAC_MMC_CONTROL_CNTSTOPRO_MASK  (0x2U)
#define ENET_QOS_MAC_MMC_CONTROL_CNTSTOPRO_SHIFT (1U)
/*! CNTSTOPRO - Counter Stop Rollover When this bit is set, the counter does not roll over to zero after reaching the maximum value.
 *  0b0..Counter Stop Rollover is disabled
 *  0b1..Counter Stop Rollover is enabled
 */
#define ENET_QOS_MAC_MMC_CONTROL_CNTSTOPRO(x)    (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MMC_CONTROL_CNTSTOPRO_SHIFT)) & ENET_QOS_MAC_MMC_CONTROL_CNTSTOPRO_MASK)

#define ENET_QOS_MAC_MMC_CONTROL_RSTONRD_MASK    (0x4U)
#define ENET_QOS_MAC_MMC_CONTROL_RSTONRD_SHIFT   (2U)
/*! RSTONRD - Reset on Read When this bit is set, the MMC counters are reset to zero after Read (self-clearing after reset).
 *  0b0..Reset on Read is disabled
 *  0b1..Reset on Read is enabled
 */
#define ENET_QOS_MAC_MMC_CONTROL_RSTONRD(x)      (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MMC_CONTROL_RSTONRD_SHIFT)) & ENET_QOS_MAC_MMC_CONTROL_RSTONRD_MASK)

#define ENET_QOS_MAC_MMC_CONTROL_CNTFREEZ_MASK   (0x8U)
#define ENET_QOS_MAC_MMC_CONTROL_CNTFREEZ_SHIFT  (3U)
/*! CNTFREEZ - MMC Counter Freeze When this bit is set, it freezes all MMC counters to their current value.
 *  0b0..MMC Counter Freeze is disabled
 *  0b1..MMC Counter Freeze is enabled
 */
#define ENET_QOS_MAC_MMC_CONTROL_CNTFREEZ(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MMC_CONTROL_CNTFREEZ_SHIFT)) & ENET_QOS_MAC_MMC_CONTROL_CNTFREEZ_MASK)

#define ENET_QOS_MAC_MMC_CONTROL_CNTPRST_MASK    (0x10U)
#define ENET_QOS_MAC_MMC_CONTROL_CNTPRST_SHIFT   (4U)
/*! CNTPRST - Counters Preset When this bit is set, all counters are initialized or preset to almost
 *    full or almost half according to the CNTPRSTLVL bit.
 *  0b0..Counters Preset is disabled
 *  0b1..Counters Preset is enabled
 */
#define ENET_QOS_MAC_MMC_CONTROL_CNTPRST(x)      (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MMC_CONTROL_CNTPRST_SHIFT)) & ENET_QOS_MAC_MMC_CONTROL_CNTPRST_MASK)

#define ENET_QOS_MAC_MMC_CONTROL_CNTPRSTLVL_MASK (0x20U)
#define ENET_QOS_MAC_MMC_CONTROL_CNTPRSTLVL_SHIFT (5U)
/*! CNTPRSTLVL - Full-Half Preset When this bit is low and the CNTPRST bit is set, all MMC counters get preset to almost-half value.
 *  0b0..Full-Half Preset is disabled
 *  0b1..Full-Half Preset is enabled
 */
#define ENET_QOS_MAC_MMC_CONTROL_CNTPRSTLVL(x)   (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_MMC_CONTROL_CNTPRSTLVL_SHIFT)) & ENET_QOS_MAC_MMC_CONTROL_CNTPRSTLVL_MASK)

