Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
#define ENET_QOS_MTL_OPERATION_MODE_FRPE_MASK    (0x8000U)
#define ENET_QOS_MTL_OPERATION_MODE_FRPE_SHIFT   (15U)
/*! FRPE - Flexible Rx parser Enable When this bit is set to 1, the Programmable Rx Parser functionality is enabled.
 *  0b0..Flexible Rx parser is disabled
 *  0b1..Flexible Rx parser is enabled
 */
#define ENET_QOS_MTL_OPERATION_MODE_FRPE(x)      (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_OPERATION_MODE_FRPE_SHIFT)) & ENET_QOS_MTL_OPERATION_MODE_FRPE_MASK)
/*! @} */

/*! @name MTL_DBG_CTL - FIFO Debug Access Control and Status */
/*! @{ */

#define ENET_QOS_MTL_DBG_CTL_FDBGEN_MASK         (0x1U)
#define ENET_QOS_MTL_DBG_CTL_FDBGEN_SHIFT        (0U)
/*! FDBGEN - FIFO Debug Access Enable When this bit is set, it indicates that the debug mode access to the FIFO is enabled.
 *  0b0..FIFO Debug Access is disabled
 *  0b1..FIFO Debug Access is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_FDBGEN(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_FDBGEN_SHIFT)) & ENET_QOS_MTL_DBG_CTL_FDBGEN_MASK)

#define ENET_QOS_MTL_DBG_CTL_DBGMOD_MASK         (0x2U)
#define ENET_QOS_MTL_DBG_CTL_DBGMOD_SHIFT        (1U)
/*! DBGMOD - Debug Mode Access to FIFO When this bit is set, it indicates that the current access to
 *    the FIFO is read, write, and debug access.
 *  0b0..Debug Mode Access to FIFO is disabled
 *  0b1..Debug Mode Access to FIFO is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_DBGMOD(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_DBGMOD_SHIFT)) & ENET_QOS_MTL_DBG_CTL_DBGMOD_MASK)

#define ENET_QOS_MTL_DBG_CTL_BYTEEN_MASK         (0xCU)
#define ENET_QOS_MTL_DBG_CTL_BYTEEN_SHIFT        (2U)
/*! BYTEEN - Byte Enables This field indicates the number of data bytes valid in the data register during Write operation.
 *  0b00..Byte 0 valid
 *  0b01..Byte 0 and Byte 1 are valid
 *  0b10..Byte 0, Byte 1, and Byte 2 are valid
 *  0b11..All four bytes are valid
 */
#define ENET_QOS_MTL_DBG_CTL_BYTEEN(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_BYTEEN_SHIFT)) & ENET_QOS_MTL_DBG_CTL_BYTEEN_MASK)

#define ENET_QOS_MTL_DBG_CTL_PKTSTATE_MASK       (0x60U)
#define ENET_QOS_MTL_DBG_CTL_PKTSTATE_SHIFT      (5U)
/*! PKTSTATE - Encoded Packet State This field is used to write the control information to the Tx FIFO or Rx FIFO.
 *  0b00..Packet Data
 *  0b01..Control Word/Normal Status
 *  0b10..SOP Data/Last Status
 *  0b11..EOP Data/EOP
 */
#define ENET_QOS_MTL_DBG_CTL_PKTSTATE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_PKTSTATE_SHIFT)) & ENET_QOS_MTL_DBG_CTL_PKTSTATE_MASK)

#define ENET_QOS_MTL_DBG_CTL_RSTALL_MASK         (0x100U)
#define ENET_QOS_MTL_DBG_CTL_RSTALL_SHIFT        (8U)
/*! RSTALL - Reset All Pointers When this bit is set, the pointers of all FIFOs are reset when FIFO Debug Access is enabled.
 *  0b0..Reset All Pointers is disabled
 *  0b1..Reset All Pointers is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_RSTALL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_RSTALL_SHIFT)) & ENET_QOS_MTL_DBG_CTL_RSTALL_MASK)

#define ENET_QOS_MTL_DBG_CTL_RSTSEL_MASK         (0x200U)
#define ENET_QOS_MTL_DBG_CTL_RSTSEL_SHIFT        (9U)
/*! RSTSEL - Reset Pointers of Selected FIFO When this bit is set, the pointers of the
 *    currently-selected FIFO are reset when FIFO Debug Access is enabled.
 *  0b0..Reset Pointers of Selected FIFO is disabled
 *  0b1..Reset Pointers of Selected FIFO is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_RSTSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_RSTSEL_SHIFT)) & ENET_QOS_MTL_DBG_CTL_RSTSEL_MASK)

#define ENET_QOS_MTL_DBG_CTL_FIFORDEN_MASK       (0x400U)
#define ENET_QOS_MTL_DBG_CTL_FIFORDEN_SHIFT      (10U)
/*! FIFORDEN - FIFO Read Enable When this bit is set, it enables the Read operation on selected FIFO when FIFO Debug Access is enabled.
 *  0b0..FIFO Read is disabled
 *  0b1..FIFO Read is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_FIFORDEN(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_FIFORDEN_SHIFT)) & ENET_QOS_MTL_DBG_CTL_FIFORDEN_MASK)

#define ENET_QOS_MTL_DBG_CTL_FIFOWREN_MASK       (0x800U)
#define ENET_QOS_MTL_DBG_CTL_FIFOWREN_SHIFT      (11U)
/*! FIFOWREN - FIFO Write Enable When this bit is set, it enables the Write operation on selected
 *    FIFO when FIFO Debug Access is enabled.
 *  0b0..FIFO Write is disabled
 *  0b1..FIFO Write is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_FIFOWREN(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_FIFOWREN_SHIFT)) & ENET_QOS_MTL_DBG_CTL_FIFOWREN_MASK)

#define ENET_QOS_MTL_DBG_CTL_FIFOSEL_MASK        (0x3000U)
#define ENET_QOS_MTL_DBG_CTL_FIFOSEL_SHIFT       (12U)
/*! FIFOSEL - FIFO Selected for Access This field indicates the FIFO selected for debug access:
 *  0b00..Tx FIFO
 *  0b01..Tx Status FIFO (only read access when SLVMOD is set)
 *  0b10..TSO FIFO (cannot be accessed when SLVMOD is set)
 *  0b11..Rx FIFO
 */
#define ENET_QOS_MTL_DBG_CTL_FIFOSEL(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_FIFOSEL_SHIFT)) & ENET_QOS_MTL_DBG_CTL_FIFOSEL_MASK)

#define ENET_QOS_MTL_DBG_CTL_PKTIE_MASK          (0x4000U)
#define ENET_QOS_MTL_DBG_CTL_PKTIE_SHIFT         (14U)
/*! PKTIE - Receive Packet Available Interrupt Status Enable When this bit is set, an interrupt is
 *    generated when EOP of received packet is written to the Rx FIFO.
 *  0b0..Receive Packet Available Interrupt Status is disabled
 *  0b1..Receive Packet Available Interrupt Status is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_PKTIE(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_PKTIE_SHIFT)) & ENET_QOS_MTL_DBG_CTL_PKTIE_MASK)

#define ENET_QOS_MTL_DBG_CTL_STSIE_MASK          (0x8000U)
#define ENET_QOS_MTL_DBG_CTL_STSIE_SHIFT         (15U)
/*! STSIE - Transmit Status Available Interrupt Status Enable When this bit is set, an interrupt is
 *    generated when Transmit status is available in slave mode.
 *  0b0..Transmit Packet Available Interrupt Status is disabled
 *  0b1..Transmit Packet Available Interrupt Status is enabled
 */
#define ENET_QOS_MTL_DBG_CTL_STSIE(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_DBG_CTL_STSIE_SHIFT)) & ENET_QOS_MTL_DBG_CTL_STSIE_MASK)
/*! @} */

/*! @name MTL_DBG_STS - FIFO Debug Status */
/*! @{ */

