Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
/*! @name MTL_TBS_CTRL - Time Based Scheduling Control */
/*! @{ */

#define ENET_QOS_MTL_TBS_CTRL_ESTM_MASK          (0x1U)
#define ENET_QOS_MTL_TBS_CTRL_ESTM_SHIFT         (0U)
/*! ESTM - EST offset Mode When this bit is set, the Launch Time value used in Time Based Scheduling
 *    is interpreted as an EST offset value and is added to the Base Time Register (BTR) of the
 *    current list.
 *  0b0..EST offset Mode is disabled
 *  0b1..EST offset Mode is enabled
 */
#define ENET_QOS_MTL_TBS_CTRL_ESTM(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_TBS_CTRL_ESTM_SHIFT)) & ENET_QOS_MTL_TBS_CTRL_ESTM_MASK)

#define ENET_QOS_MTL_TBS_CTRL_LEOV_MASK          (0x2U)
#define ENET_QOS_MTL_TBS_CTRL_LEOV_SHIFT         (1U)
/*! LEOV - Launch Expiry Offset Valid When set indicates the LEOS field is valid.
 *  0b0..LEOS field is invalid
 *  0b1..LEOS field is valid
 */
#define ENET_QOS_MTL_TBS_CTRL_LEOV(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_TBS_CTRL_LEOV_SHIFT)) & ENET_QOS_MTL_TBS_CTRL_LEOV_MASK)

#define ENET_QOS_MTL_TBS_CTRL_LEGOS_MASK         (0x70U)
#define ENET_QOS_MTL_TBS_CTRL_LEGOS_SHIFT        (4U)
/*! LEGOS - Launch Expiry GSN Offset The number GSN slots that has to be added to the Launch GSN to compute the Launch Expiry time. */
#define ENET_QOS_MTL_TBS_CTRL_LEGOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_TBS_CTRL_LEGOS_SHIFT)) & ENET_QOS_MTL_TBS_CTRL_LEGOS_MASK)

#define ENET_QOS_MTL_TBS_CTRL_LEOS_MASK          (0xFFFFFF00U)
#define ENET_QOS_MTL_TBS_CTRL_LEOS_SHIFT         (8U)
/*! LEOS - Launch Expiry Offset The value in units of 256 nanoseconds that has to be added to the
 *    Launch time to compute the Launch Expiry time.
 */
#define ENET_QOS_MTL_TBS_CTRL_LEOS(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_TBS_CTRL_LEOS_SHIFT)) & ENET_QOS_MTL_TBS_CTRL_LEOS_MASK)
/*! @} */

/*! @name MTL_EST_CONTROL - Enhancements to Scheduled Transmission Control */
/*! @{ */

#define ENET_QOS_MTL_EST_CONTROL_EEST_MASK       (0x1U)
#define ENET_QOS_MTL_EST_CONTROL_EEST_SHIFT      (0U)
/*! EEST - Enable EST When reset, the gate control list processing is halted and all gates are assumed to be in Open state.
 *  0b0..EST is disabled
 *  0b1..EST is enabled
 */
#define ENET_QOS_MTL_EST_CONTROL_EEST(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_EEST_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_EEST_MASK)

#define ENET_QOS_MTL_EST_CONTROL_SSWL_MASK       (0x2U)
#define ENET_QOS_MTL_EST_CONTROL_SSWL_SHIFT      (1U)
/*! SSWL - Switch to S/W owned list When set indicates that the software has programmed that list
 *    that it currently owns (SWOL) and the hardware should switch to the new list based on the new
 *    BTR.
 *  0b0..Switch to S/W owned list is disabled
 *  0b1..Switch to S/W owned list is enabled
 */
#define ENET_QOS_MTL_EST_CONTROL_SSWL(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_SSWL_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_SSWL_MASK)

#define ENET_QOS_MTL_EST_CONTROL_DDBF_MASK       (0x10U)
#define ENET_QOS_MTL_EST_CONTROL_DDBF_SHIFT      (4U)
/*! DDBF - Do not Drop frames during Frame Size Error When set, frames are not be dropped during
 *    Head-of-Line blocking due to Frame Size Error (HLBF field of MTL_EST_STATUS register).
 *  0b0..Drop frames during Frame Size Error
 *  0b1..Do not Drop frames during Frame Size Error
 */
#define ENET_QOS_MTL_EST_CONTROL_DDBF(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_DDBF_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_DDBF_MASK)

#define ENET_QOS_MTL_EST_CONTROL_DFBS_MASK       (0x20U)
#define ENET_QOS_MTL_EST_CONTROL_DFBS_SHIFT      (5U)
/*! DFBS - Drop Frames causing Scheduling Error When set frames reported to cause HOL Blocking due
 *    to not getting scheduled (HLBS field of EST_STATUS register) after 4,8,16,32 (based on LCSE
 *    field of this register) GCL iterations are dropped.
 *  0b0..Do not Drop Frames causing Scheduling Error
 *  0b1..Drop Frames causing Scheduling Error
 */
#define ENET_QOS_MTL_EST_CONTROL_DFBS(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_DFBS_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_DFBS_MASK)

#define ENET_QOS_MTL_EST_CONTROL_LCSE_MASK       (0xC0U)
#define ENET_QOS_MTL_EST_CONTROL_LCSE_SHIFT      (6U)
/*! LCSE - Loop Count to report Scheduling Error Programmable number of GCL list iterations before
 *    reporting an HLBS error defined in EST_STATUS register.
 *  0b00..4 iterations
 *  0b01..8 iterations
 *  0b10..16 iterations
 *  0b11..32 iterations
 */
#define ENET_QOS_MTL_EST_CONTROL_LCSE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_LCSE_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_LCSE_MASK)

#define ENET_QOS_MTL_EST_CONTROL_TILS_MASK       (0x700U)
#define ENET_QOS_MTL_EST_CONTROL_TILS_SHIFT      (8U)
/*! TILS - Time Interval Left Shift Amount This field provides the left shift amount for the
 *    programmed Time Interval values used in the Gate Control Lists.
 */
#define ENET_QOS_MTL_EST_CONTROL_TILS(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_TILS_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_TILS_MASK)

#define ENET_QOS_MTL_EST_CONTROL_CTOV_MASK       (0xFFF000U)
#define ENET_QOS_MTL_EST_CONTROL_CTOV_SHIFT      (12U)
/*! CTOV - Current Time Offset Value Provides a 12 bit time offset value in nano second that is
 *    added to the current time to compensate for all the implementation pipeline delays such as the CDC
 *    sync delay, buffering delays, data path delays etc.
 */
#define ENET_QOS_MTL_EST_CONTROL_CTOV(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_CTOV_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_CTOV_MASK)

#define ENET_QOS_MTL_EST_CONTROL_PTOV_MASK       (0xFF000000U)
#define ENET_QOS_MTL_EST_CONTROL_PTOV_SHIFT      (24U)
/*! PTOV - PTP Time Offset Value The value of PTP Clock period multiplied by 6 in nanoseconds. */
#define ENET_QOS_MTL_EST_CONTROL_PTOV(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_CONTROL_PTOV_SHIFT)) & ENET_QOS_MTL_EST_CONTROL_PTOV_MASK)
/*! @} */

/*! @name MTL_EST_EXT_CONTROL - MTL_EST_EXT_CONTROL */
/*! @{ */

#define ENET_QOS_MTL_EST_EXT_CONTROL_OVHD_MASK   (0x3FU)
#define ENET_QOS_MTL_EST_EXT_CONTROL_OVHD_SHIFT  (0U)
/*! OVHD - Overhead Bytes Value */
#define ENET_QOS_MTL_EST_EXT_CONTROL_OVHD(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_EXT_CONTROL_OVHD_SHIFT)) & ENET_QOS_MTL_EST_EXT_CONTROL_OVHD_MASK)
/*! @} */

/*! @name MTL_EST_STATUS - Enhancements to Scheduled Transmission Status */
/*! @{ */

#define ENET_QOS_MTL_EST_STATUS_SWLC_MASK        (0x1U)
#define ENET_QOS_MTL_EST_STATUS_SWLC_SHIFT       (0U)
/*! SWLC - Switch to S/W owned list Complete When "1" indicates the hardware has successfully
 *    switched to the SWOL, and the SWOL bit has been updated to that effect.
 *  0b0..Switch to S/W owned list Complete not detected
 *  0b1..Switch to S/W owned list Complete detected
 */
#define ENET_QOS_MTL_EST_STATUS_SWLC(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_SWLC_SHIFT)) & ENET_QOS_MTL_EST_STATUS_SWLC_MASK)

#define ENET_QOS_MTL_EST_STATUS_BTRE_MASK        (0x2U)
#define ENET_QOS_MTL_EST_STATUS_BTRE_SHIFT       (1U)
/*! BTRE - BTR Error When "1" indicates a programming error in the BTR of SWOL where the programmed
 *    value is less than current time.
 *  0b0..BTR Error not detected
 *  0b1..BTR Error detected
 */
#define ENET_QOS_MTL_EST_STATUS_BTRE(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_BTRE_SHIFT)) & ENET_QOS_MTL_EST_STATUS_BTRE_MASK)

#define ENET_QOS_MTL_EST_STATUS_HLBF_MASK        (0x4U)
#define ENET_QOS_MTL_EST_STATUS_HLBF_SHIFT       (2U)
/*! HLBF - Head-Of-Line Blocking due to Frame Size Set when HOL Blocking is noticed on one or more
 *    Queues as a result of none of the Time Intervals of gate open in the GCL being greater than or
 *    equal to the duration needed for frame size (or frame fragment size when preemption is
 *    enabled) transmission.
 *  0b0..Head-Of-Line Blocking due to Frame Size not detected
 *  0b1..Head-Of-Line Blocking due to Frame Size detected
 */
#define ENET_QOS_MTL_EST_STATUS_HLBF(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_HLBF_SHIFT)) & ENET_QOS_MTL_EST_STATUS_HLBF_MASK)

#define ENET_QOS_MTL_EST_STATUS_HLBS_MASK        (0x8U)
#define ENET_QOS_MTL_EST_STATUS_HLBS_SHIFT       (3U)
/*! HLBS - Head-Of-Line Blocking due to Scheduling Set when the frame is not able to win arbitration
 *    and get scheduled even after 4 iterations of the GCL.
 *  0b0..Head-Of-Line Blocking due to Scheduling not detected
 *  0b1..Head-Of-Line Blocking due to Scheduling detected
 */
#define ENET_QOS_MTL_EST_STATUS_HLBS(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_HLBS_SHIFT)) & ENET_QOS_MTL_EST_STATUS_HLBS_MASK)

#define ENET_QOS_MTL_EST_STATUS_CGCE_MASK        (0x10U)
#define ENET_QOS_MTL_EST_STATUS_CGCE_SHIFT       (4U)
/*! CGCE - Constant Gate Control Error This error occurs when the list length (LLR) is 1 and the
 *    programmed Time Interval (TI) value after the optional Left Shifting is less than or equal to the
 *    Cycle Time (CTR).
 *  0b0..Constant Gate Control Error not detected
 *  0b1..Constant Gate Control Error detected
 */
#define ENET_QOS_MTL_EST_STATUS_CGCE(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_STATUS_CGCE_SHIFT)) & ENET_QOS_MTL_EST_STATUS_CGCE_MASK)

