Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
/*! @name MTL_EST_GCL_CONTROL - EST GCL Control */
/*! @{ */

#define ENET_QOS_MTL_EST_GCL_CONTROL_SRWO_MASK   (0x1U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_SRWO_SHIFT  (0U)
/*! SRWO - Start Read/Write Op When set indicates a Read/Write Op has started and is in progress.
 *  0b0..Start Read/Write Op disabled
 *  0b1..Start Read/Write Op enabled
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_SRWO(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_SRWO_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_SRWO_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_R1W0_MASK   (0x2U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_R1W0_SHIFT  (1U)
/*! R1W0 - Read '1', Write '0': When set to '1': Read Operation When set to '0': Write Operation.
 *  0b0..Write Operation
 *  0b1..Read Operation
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_R1W0(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_R1W0_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_R1W0_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_GCRR_MASK   (0x4U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_GCRR_SHIFT  (2U)
/*! GCRR - Gate Control Related Registers When set to "1" indicates the R/W access is for the GCL
 *    related registers (BTR, CTR, TER, LLR) whose address is provided by GCRA.
 *  0b0..Gate Control Related Registers are disabled
 *  0b1..Gate Control Related Registers are enabled
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_GCRR(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_GCRR_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_GCRR_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_DBGM_MASK   (0x10U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_DBGM_SHIFT  (4U)
/*! DBGM - Debug Mode When set to "1" indicates R/W in debug mode where the memory bank (for GCL and
 *    Time related registers) is explicitly provided by DBGB value, when set to "0" SWOL bit is
 *    used to determine which bank to use.
 *  0b0..Debug Mode is disabled
 *  0b1..Debug Mode is enabled
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_DBGM(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_DBGM_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_DBGM_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_DBGB_MASK   (0x20U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_DBGB_SHIFT  (5U)
/*! DBGB - Debug Mode Bank Select When set to "0" indicates R/W in debug mode should be directed to
 *    Bank 0 (GCL0 and corresponding Time related registers).
 *  0b0..R/W in debug mode should be directed to Bank 0
 *  0b1..R/W in debug mode should be directed to Bank 1
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_DBGB(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_DBGB_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_DBGB_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_ADDR_MASK   (0x1FF00U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_ADDR_SHIFT  (8U)
/*! ADDR - Gate Control List Address: (GCLA when GCRR is "0"). */
#define ENET_QOS_MTL_EST_GCL_CONTROL_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_ADDR_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_ADDR_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_ERR0_MASK   (0x100000U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_ERR0_SHIFT  (20U)
/*! ERR0 - When set indicates the last write operation was aborted as software writes to GCL and GCL
 *    registers is prohibited when SSWL bit of MTL_EST_CONTROL Register is set.
 *  0b0..ERR0 is disabled
 *  0b1..ERR1 is enabled
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_ERR0(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_ERR0_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_ERR0_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEE_MASK (0x200000U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEE_SHIFT (21U)
/*! ESTEIEE - EST ECC Inject Error Enable When set along with EEST bit of MTL_EST_CONTROL register,
 *    enables the ECC error injection feature.
 *  0b0..EST ECC Inject Error is disabled
 *  0b1..EST ECC Inject Error is enabled
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEE(x)  (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEE_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEE_MASK)

#define ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEC_MASK (0xC00000U)
#define ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEC_SHIFT (22U)
/*! ESTEIEC - ECC Inject Error Control for EST Memory When EIEE bit of this register is set,
 *    following are the errors inserted based on the value encoded in this field.
 *  0b00..Insert 1 bit error
 *  0b01..Insert 2 bit errors
 *  0b10..Insert 3 bit errors
 *  0b11..Insert 1 bit error in address field
 */
#define ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEC(x)  (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEC_SHIFT)) & ENET_QOS_MTL_EST_GCL_CONTROL_ESTEIEC_MASK)
/*! @} */

/*! @name MTL_EST_GCL_DATA - EST GCL Data */
/*! @{ */

#define ENET_QOS_MTL_EST_GCL_DATA_GCD_MASK       (0xFFFFFFFFU)
#define ENET_QOS_MTL_EST_GCL_DATA_GCD_SHIFT      (0U)
/*! GCD - Gate Control Data The data corresponding to the address selected in the MTL_GCL_CONTROL register. */
#define ENET_QOS_MTL_EST_GCL_DATA_GCD(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_EST_GCL_DATA_GCD_SHIFT)) & ENET_QOS_MTL_EST_GCL_DATA_GCD_MASK)
/*! @} */

/*! @name MTL_FPE_CTRL_STS - Frame Preemption Control and Status */
/*! @{ */

#define ENET_QOS_MTL_FPE_CTRL_STS_AFSZ_MASK      (0x3U)
#define ENET_QOS_MTL_FPE_CTRL_STS_AFSZ_SHIFT     (0U)
/*! AFSZ - Additional Fragment Size used to indicate, in units of 64 bytes, the minimum number of
 *    bytes over 64 bytes required in non-final fragments of preempted frames.
 */
#define ENET_QOS_MTL_FPE_CTRL_STS_AFSZ(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_FPE_CTRL_STS_AFSZ_SHIFT)) & ENET_QOS_MTL_FPE_CTRL_STS_AFSZ_MASK)

#define ENET_QOS_MTL_FPE_CTRL_STS_PEC_MASK       (0x1F00U)
#define ENET_QOS_MTL_FPE_CTRL_STS_PEC_SHIFT      (8U)
/*! PEC - Preemption Classification When set indicates the corresponding Queue must be classified as
 *    preemptable, when '0' Queue is classified as express.
 */
#define ENET_QOS_MTL_FPE_CTRL_STS_PEC(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_FPE_CTRL_STS_PEC_SHIFT)) & ENET_QOS_MTL_FPE_CTRL_STS_PEC_MASK)

#define ENET_QOS_MTL_FPE_CTRL_STS_HRS_MASK       (0x10000000U)
#define ENET_QOS_MTL_FPE_CTRL_STS_HRS_SHIFT      (28U)
/*! HRS - Hold/Release Status - 1: Indicates a Set-and-Hold-MAC operation was last executed and the pMAC is in Hold State.
 *  0b0..Indicates a Set-and-Release-MAC operation was last executed and the pMAC is in Release State
 *  0b1..Indicates a Set-and-Hold-MAC operation was last executed and the pMAC is in Hold State
 */
#define ENET_QOS_MTL_FPE_CTRL_STS_HRS(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MTL_FPE_CTRL_STS_HRS_SHIFT)) & ENET_QOS_MTL_FPE_CTRL_STS_HRS_MASK)
/*! @} */

