Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
#define ENET_QOS_DMA_TBS_CTRL1_FGOS_MASK         (0x70U)
#define ENET_QOS_DMA_TBS_CTRL1_FGOS_SHIFT        (4U)
/*! FGOS - Fetch GSN Offset */
#define ENET_QOS_DMA_TBS_CTRL1_FGOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL1_FGOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL1_FGOS_MASK)

#define ENET_QOS_DMA_TBS_CTRL1_FTOS_MASK         (0xFFFFFF00U)
#define ENET_QOS_DMA_TBS_CTRL1_FTOS_SHIFT        (8U)
/*! FTOS - Fetch Time Offset */
#define ENET_QOS_DMA_TBS_CTRL1_FTOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL1_FTOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL1_FTOS_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL2 - DMA_TBS_CTRL2 */
/*! @{ */

#define ENET_QOS_DMA_TBS_CTRL2_FTOV_MASK         (0x1U)
#define ENET_QOS_DMA_TBS_CTRL2_FTOV_SHIFT        (0U)
/*! FTOV - Fetch Time Offset Valid When set indicates the FTOS field is valid. When not set,
 *    indicates the Fetch Offset is not valid and the DMA engine can fetch the frames from host memory
 *    without any time restrictions.
 *  0b0..Fetch Time Offset is invalid
 *  0b1..Fetch Time Offset is valid
 */
#define ENET_QOS_DMA_TBS_CTRL2_FTOV(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL2_FTOV_SHIFT)) & ENET_QOS_DMA_TBS_CTRL2_FTOV_MASK)

#define ENET_QOS_DMA_TBS_CTRL2_FGOS_MASK         (0x70U)
#define ENET_QOS_DMA_TBS_CTRL2_FGOS_SHIFT        (4U)
/*! FGOS - Fetch GSN Offset */
#define ENET_QOS_DMA_TBS_CTRL2_FGOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL2_FGOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL2_FGOS_MASK)

#define ENET_QOS_DMA_TBS_CTRL2_FTOS_MASK         (0xFFFFFF00U)
#define ENET_QOS_DMA_TBS_CTRL2_FTOS_SHIFT        (8U)
/*! FTOS - Fetch Time Offset */
#define ENET_QOS_DMA_TBS_CTRL2_FTOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL2_FTOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL2_FTOS_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL3 - DMA_TBS_CTRL3 */
/*! @{ */

#define ENET_QOS_DMA_TBS_CTRL3_FTOV_MASK         (0x1U)
#define ENET_QOS_DMA_TBS_CTRL3_FTOV_SHIFT        (0U)
/*! FTOV - Fetch Time Offset Valid When set indicates the FTOS field is valid. When not set,
 *    indicates the Fetch Offset is not valid and the DMA engine can fetch the frames from host memory
 *    without any time restrictions.
 *  0b0..Fetch Time Offset is invalid
 *  0b1..Fetch Time Offset is valid
 */
#define ENET_QOS_DMA_TBS_CTRL3_FTOV(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL3_FTOV_SHIFT)) & ENET_QOS_DMA_TBS_CTRL3_FTOV_MASK)

#define ENET_QOS_DMA_TBS_CTRL3_FGOS_MASK         (0x70U)
#define ENET_QOS_DMA_TBS_CTRL3_FGOS_SHIFT        (4U)
/*! FGOS - Fetch GSN Offset */
#define ENET_QOS_DMA_TBS_CTRL3_FGOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL3_FGOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL3_FGOS_MASK)

#define ENET_QOS_DMA_TBS_CTRL3_FTOS_MASK         (0xFFFFFF00U)
#define ENET_QOS_DMA_TBS_CTRL3_FTOS_SHIFT        (8U)
/*! FTOS - Fetch Time Offset */
#define ENET_QOS_DMA_TBS_CTRL3_FTOS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_TBS_CTRL3_FTOS_SHIFT)) & ENET_QOS_DMA_TBS_CTRL3_FTOS_MASK)
/*! @} */

/*! @name DMA_CHX_CTRL - DMA Channel 0 Control..Channel 4 Control */
/*! @{ */

#define ENET_QOS_DMA_CHX_CTRL_PBLx8_MASK         (0x10000U)
#define ENET_QOS_DMA_CHX_CTRL_PBLx8_SHIFT        (16U)
/*! PBLx8 - 8xPBL mode When this bit is set, the PBL value programmed in Bits[21:16] in
 *    DMA_CH4_TX_CONTROL and Bits[21:16] in DMA_CH4_RX_CONTROL is multiplied by eight times.
 *  0b0..8xPBL mode is disabled
 *  0b1..8xPBL mode is enabled
 */
#define ENET_QOS_DMA_CHX_CTRL_PBLx8(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_CTRL_PBLx8_SHIFT)) & ENET_QOS_DMA_CHX_CTRL_PBLx8_MASK)

#define ENET_QOS_DMA_CHX_CTRL_DSL_MASK           (0x1C0000U)
#define ENET_QOS_DMA_CHX_CTRL_DSL_SHIFT          (18U)
/*! DSL - Descriptor Skip Length This bit specifies the Word, Dword, or Lword number (depending on
 *    the 32-bit, 64-bit, or 128-bit bus) to skip between two unchained descriptors.
 */
#define ENET_QOS_DMA_CHX_CTRL_DSL(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_CTRL_DSL_SHIFT)) & ENET_QOS_DMA_CHX_CTRL_DSL_MASK)
/*! @} */

/* The count of ENET_QOS_DMA_CHX_CTRL */
#define ENET_QOS_DMA_CHX_CTRL_COUNT              (5U)

/*! @name DMA_CHX_TX_CTRL - DMA Channel 0 Transmit Control..DMA Channel 4 Transmit Control */
/*! @{ */

#define ENET_QOS_DMA_CHX_TX_CTRL_ST_MASK         (0x1U)
#define ENET_QOS_DMA_CHX_TX_CTRL_ST_SHIFT        (0U)
/*! ST - Start or Stop Transmission Command When this bit is set, transmission is placed in the Running state.
 *  0b0..Stop Transmission Command
 *  0b1..Start Transmission Command
 */
#define ENET_QOS_DMA_CHX_TX_CTRL_ST(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_TX_CTRL_ST_SHIFT)) & ENET_QOS_DMA_CHX_TX_CTRL_ST_MASK)

#define ENET_QOS_DMA_CHX_TX_CTRL_OSF_MASK        (0x10U)
#define ENET_QOS_DMA_CHX_TX_CTRL_OSF_SHIFT       (4U)
/*! OSF - Operate on Second Packet When this bit is set, it instructs the DMA to process the second
 *    packet of the Transmit data even before the status for the first packet is obtained.
 *  0b0..Operate on Second Packet disabled
 *  0b1..Operate on Second Packet enabled
 */
#define ENET_QOS_DMA_CHX_TX_CTRL_OSF(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_TX_CTRL_OSF_SHIFT)) & ENET_QOS_DMA_CHX_TX_CTRL_OSF_MASK)

#define ENET_QOS_DMA_CHX_TX_CTRL_IPBL_MASK       (0x8000U)
#define ENET_QOS_DMA_CHX_TX_CTRL_IPBL_SHIFT      (15U)
/*! IPBL - Ignore PBL Requirement When this bit is set, the DMA does not check for PBL number of
 *    locations in the MTL before initiating a transfer.
 *  0b0..Ignore PBL Requirement is disabled
 *  0b1..Ignore PBL Requirement is enabled
 */
#define ENET_QOS_DMA_CHX_TX_CTRL_IPBL(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_TX_CTRL_IPBL_SHIFT)) & ENET_QOS_DMA_CHX_TX_CTRL_IPBL_MASK)

#define ENET_QOS_DMA_CHX_TX_CTRL_TxPBL_MASK      (0x3F0000U)
#define ENET_QOS_DMA_CHX_TX_CTRL_TxPBL_SHIFT     (16U)
/*! TxPBL - Transmit Programmable Burst Length These bits indicate the maximum number of beats to be
 *    transferred in one DMA block data transfer.
 */
#define ENET_QOS_DMA_CHX_TX_CTRL_TxPBL(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_TX_CTRL_TxPBL_SHIFT)) & ENET_QOS_DMA_CHX_TX_CTRL_TxPBL_MASK)

#define ENET_QOS_DMA_CHX_TX_CTRL_EDSE_MASK       (0x10000000U)
#define ENET_QOS_DMA_CHX_TX_CTRL_EDSE_SHIFT      (28U)
/*! EDSE - Enhanced Descriptor Enable When this bit is set, the corresponding channel uses Enhanced
 *    Descriptors that are 32 Bytes for both Normal and Context Descriptors.
 *  0b0..Enhanced Descriptor is disabled
 *  0b1..Enhanced Descriptor is enabled
 */
#define ENET_QOS_DMA_CHX_TX_CTRL_EDSE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_TX_CTRL_EDSE_SHIFT)) & ENET_QOS_DMA_CHX_TX_CTRL_EDSE_MASK)
/*! @} */

