Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_ENET_QOS.h
#define ENET_QOS_DMA_CHX_STAT_ETI_MASK           (0x400U)
#define ENET_QOS_DMA_CHX_STAT_ETI_SHIFT          (10U)
/*! ETI - Early Transmit Interrupt This bit when set indicates that the TxDMA has completed the
 *    transfer of packet data to the MTL TXFIFO memory.
 *  0b0..Early Transmit Interrupt status not detected
 *  0b1..Early Transmit Interrupt status detected
 */
#define ENET_QOS_DMA_CHX_STAT_ETI(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_ETI_SHIFT)) & ENET_QOS_DMA_CHX_STAT_ETI_MASK)

#define ENET_QOS_DMA_CHX_STAT_ERI_MASK           (0x800U)
#define ENET_QOS_DMA_CHX_STAT_ERI_SHIFT          (11U)
/*! ERI - Early Receive Interrupt This bit when set indicates that the RxDMA has completed the
 *    transfer of packet data to the memory.
 *  0b0..Early Receive Interrupt status not detected
 *  0b1..Early Receive Interrupt status detected
 */
#define ENET_QOS_DMA_CHX_STAT_ERI(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_ERI_SHIFT)) & ENET_QOS_DMA_CHX_STAT_ERI_MASK)

#define ENET_QOS_DMA_CHX_STAT_FBE_MASK           (0x1000U)
#define ENET_QOS_DMA_CHX_STAT_FBE_SHIFT          (12U)
/*! FBE - Fatal Bus Error This bit indicates that a bus error occurred (as described in the EB field).
 *  0b0..Fatal Bus Error status not detected
 *  0b1..Fatal Bus Error status detected
 */
#define ENET_QOS_DMA_CHX_STAT_FBE(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_FBE_SHIFT)) & ENET_QOS_DMA_CHX_STAT_FBE_MASK)

#define ENET_QOS_DMA_CHX_STAT_CDE_MASK           (0x2000U)
#define ENET_QOS_DMA_CHX_STAT_CDE_SHIFT          (13U)
/*! CDE - Context Descriptor Error This bit indicates that the DMA Tx/Rx engine received a
 *    descriptor error, which indicates invalid context in the middle of packet flow ( intermediate
 *    descriptor) or all one's descriptor in Tx case and on Rx side it indicates DMA has read a descriptor
 *    with either of the buffer address as ones which is considered to be invalid.
 *  0b0..Context Descriptor Error status not detected
 *  0b1..Context Descriptor Error status detected
 */
#define ENET_QOS_DMA_CHX_STAT_CDE(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_CDE_SHIFT)) & ENET_QOS_DMA_CHX_STAT_CDE_MASK)

#define ENET_QOS_DMA_CHX_STAT_AIS_MASK           (0x4000U)
#define ENET_QOS_DMA_CHX_STAT_AIS_SHIFT          (14U)
/*! AIS - Abnormal Interrupt Summary Abnormal Interrupt Summary bit value is the logical OR of the
 *    following when the corresponding interrupt bits are enabled in the DMA_CH3_INTERRUPT_ENABLE
 *    register: - Bit 1: Transmit Process Stopped - Bit 7: Receive Buffer Unavailable - Bit 8: Receive
 *    Process Stopped - Bit 10: Early Transmit Interrupt - Bit 12: Fatal Bus Error - Bit 13: Context
 *    Descriptor Error Only unmasked bits affect the Abnormal Interrupt Summary bit.
 *  0b0..Abnormal Interrupt Summary status not detected
 *  0b1..Abnormal Interrupt Summary status detected
 */
#define ENET_QOS_DMA_CHX_STAT_AIS(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_AIS_SHIFT)) & ENET_QOS_DMA_CHX_STAT_AIS_MASK)

#define ENET_QOS_DMA_CHX_STAT_NIS_MASK           (0x8000U)
#define ENET_QOS_DMA_CHX_STAT_NIS_SHIFT          (15U)
/*! NIS - Normal Interrupt Summary Normal Interrupt Summary bit value is the logical OR of the
 *    following bits when the corresponding interrupt bits are enabled in the DMA_CH3_INTERRUPT_ENABLE
 *    register: - Bit 0: Transmit Interrupt - Bit 2: Transmit Buffer Unavailable - Bit 6: Receive
 *    Interrupt - Bit 11: Early Receive Interrupt Only unmasked bits (interrupts for which interrupt
 *    enable is set in DMA_CH3_INTERRUPT_ENABLE register) affect the Normal Interrupt Summary bit.
 *  0b0..Normal Interrupt Summary status not detected
 *  0b1..Normal Interrupt Summary status detected
 */
#define ENET_QOS_DMA_CHX_STAT_NIS(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_NIS_SHIFT)) & ENET_QOS_DMA_CHX_STAT_NIS_MASK)

#define ENET_QOS_DMA_CHX_STAT_TEB_MASK           (0x70000U)
#define ENET_QOS_DMA_CHX_STAT_TEB_SHIFT          (16U)
/*! TEB - Tx DMA Error Bits This field indicates the type of error that caused a Bus Error. */
#define ENET_QOS_DMA_CHX_STAT_TEB(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_TEB_SHIFT)) & ENET_QOS_DMA_CHX_STAT_TEB_MASK)

#define ENET_QOS_DMA_CHX_STAT_REB_MASK           (0x380000U)
#define ENET_QOS_DMA_CHX_STAT_REB_SHIFT          (19U)
/*! REB - Rx DMA Error Bits This field indicates the type of error that caused a Bus Error. */
#define ENET_QOS_DMA_CHX_STAT_REB(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_STAT_REB_SHIFT)) & ENET_QOS_DMA_CHX_STAT_REB_MASK)
/*! @} */

/* The count of ENET_QOS_DMA_CHX_STAT */
#define ENET_QOS_DMA_CHX_STAT_COUNT              (5U)

/*! @name DMA_CHX_MISS_FRAME_CNT - Channel 0 Missed Frame Counter..Channel 4 Missed Frame Counter */
/*! @{ */

#define ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFC_MASK (0x7FFU)
#define ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFC_SHIFT (0U)
/*! MFC - Dropped Packet Counters This counter indicates the number of packet counters that are
 *    dropped by the DMA either because of bus error or because of programming RPF field in
 *    DMA_CH2_RX_CONTROL register.
 */
#define ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFC(x)   (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFC_SHIFT)) & ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFC_MASK)

#define ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFCO_MASK (0x8000U)
#define ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFCO_SHIFT (15U)
/*! MFCO - Overflow status of the MFC Counter When this bit is set then the MFC counter does not get incremented further.
 *  0b0..Miss Frame Counter overflow not occurred
 *  0b1..Miss Frame Counter overflow occurred
 */
#define ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFCO(x)  (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFCO_SHIFT)) & ENET_QOS_DMA_CHX_MISS_FRAME_CNT_MFCO_MASK)
/*! @} */

/* The count of ENET_QOS_DMA_CHX_MISS_FRAME_CNT */
#define ENET_QOS_DMA_CHX_MISS_FRAME_CNT_COUNT    (5U)

/*! @name DMA_CHX_RXP_ACCEPT_CNT - Channel 0 RXP Frames Accepted Counter..Channel 4 RXP Frames Accepted Counter */
/*! @{ */

#define ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_MASK (0x7FFFFFFFU)
#define ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_SHIFT (0U)
/*! RXPAC - Rx Parser Accept Counter This 31-bit counter is implemented whenever a Rx Parser Accept a packet due to AF =1. */
#define ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPAC(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_SHIFT)) & ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_MASK)

#define ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_MASK (0x80000000U)
#define ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_SHIFT (31U)
/*! RXPACOF - Rx Parser Accept Counter Overflow Bit When set, this bit indicates that the RXPAC
 *    Counter field crossed the maximum limit.
 *  0b0..Rx Parser Accept Counter overflow not occurred
 *  0b1..Rx Parser Accept Counter overflow occurred
 */
#define ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF(x) (((uint32_t)(((uint32_t)(x)) << ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_SHIFT)) & ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_MASK)
/*! @} */

/* The count of ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT */
#define ENET_QOS_DMA_CHX_RXP_ACCEPT_CNT_COUNT    (5U)


/*!
 * @}
 */ /* end of group ENET_QOS_Register_Masks */


/*!
 * @}
 */ /* end of group ENET_QOS_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ENET_QOS_H_ */

